# Subselection in pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
a=np.random.randn(3,4)
a

array([[-1.04249551,  0.71819883, -2.2308811 , -1.2341851 ],
       [ 0.27433127,  0.15112832,  2.10907124, -0.13878267],
       [ 0.20536696,  1.43624367, -1.88441081,  1.53556805]])

In [3]:
df=pd.DataFrame(a,['r1','r2','r3'],['c1','c2','c3','c4'])
df

          c1        c2        c3        c4
r1 -1.042496  0.718199 -2.230881 -1.234185
r2  0.274331  0.151128  2.109071 -0.138783
r3  0.205367  1.436244 -1.884411  1.535568

In [4]:
df.loc['r2']

c1    0.274331
c2    0.151128
c3    2.109071
c4   -0.138783
Name: r2, dtype: float64

In [5]:
df.loc[['r1','r2'],['c3','c4']]

          c3        c4
r1 -2.230881 -1.234185
r2  2.109071 -0.138783

In [6]:
df

          c1        c2        c3        c4
r1 -1.042496  0.718199 -2.230881 -1.234185
r2  0.274331  0.151128  2.109071 -0.138783
r3  0.205367  1.436244 -1.884411  1.535568

In [7]:
df.loc[['r1','r2'],['c1','c2']]

          c1        c2
r1 -1.042496  0.718199
r2  0.274331  0.151128

In [8]:
df.loc[['r2','r3'],['c1','c2']]

          c1        c2
r2  0.274331  0.151128
r3  0.205367  1.436244

In [9]:
df.loc[['r2','r3'],['c3','c4']]

          c3        c4
r2  2.109071 -0.138783
r3 -1.884411  1.535568

In [10]:
df.loc[['r2','r3']]

          c1        c2        c3        c4
r2  0.274331  0.151128  2.109071 -0.138783
r3  0.205367  1.436244 -1.884411  1.535568

# Conditional selection in pandas

In [11]:
df>0

       c1    c2     c3     c4
r1  False  True  False  False
r2   True  True   True  False
r3   True  True  False   True

In [12]:
df[df>0]

          c1        c2        c3        c4
r1       NaN  0.718199       NaN       NaN
r2  0.274331  0.151128  2.109071       NaN
r3  0.205367  1.436244       NaN  1.535568

In [25]:
df

          c1        c2        c3        c4
r1 -1.042496  0.718199 -2.230881 -1.234185
r2  0.274331  0.151128  2.109071 -0.138783
r3  0.205367  1.436244 -1.884411  1.535568

In [34]:
df[df['c2']>0]

          c1        c2        c3        c4
r1 -1.042496  0.718199 -2.230881 -1.234185
r2  0.274331  0.151128  2.109071 -0.138783
r3  0.205367  1.436244 -1.884411  1.535568